{
  "Zelensky due at Downing Street for high-level Ukraine talks": "https://www.bbc.com/news/articles/c2k4z9nwz4yo",
  "Man found guilty of Australian beach murder after hiding in India for years": "https://www.bbc.com/news/articles/c4g9lg7jvq7o",
  "Benin coup thwarted by loyalist troops, president tells nation": "https://www.bbc.com/news/articles/c62v7n9wzkyo",
  "Jeremy Bowen: Syria feels lighter without the Assads' crushing weight - but now there are new problems": "https://www.bbc.com/news/articles/cy7v53366ejo",
  "Water leak in Louvre damages hundreds of books": "https://www.bbc.com/news/articles/c2dzjk9d825o",
  "Japan protests after Chinese fighter jets lock radar on Japanese planes": "https://www.bbc.com/news/articles/c5yqe197ypno",
  "Death of Venezuelan opposition figure in custody 'vile', US says": "https://www.bbc.com/news/articles/czj0m2evm40o",
  "New US security strategy aligns with Russia's vision, Moscow says": "https://www.bbc.com/news/articles/cpvd01g2kwwo",
  "Nightclub fire in India's Goa kills 25 staff and tourists": "https://www.bbc.com/news/articles/cdj82d0nd4eo",
  "Ukrainian city hit by 'massive' strike as peace talks in US conclude": "https://www.bbc.com/news/articles/cz680jx511no",
  "Hong Kong votes in election as city mourns deadly fire": "https://www.bbc.com/news/articles/c3r7plnwr0zo",
  "White South Africans divided on US refugee offer": "https://www.bbc.com/news/articles/c2lvk2gql97o",
  "Japan is facing a dementia crisis – can technology help?": "https://www.bbc.com/news/articles/c4g9e34yzvgo",
  "Can you ban kids from social media? Australia is about to, but some teens are a step ahead": "https://www.bbc.com/news/articles/crk7xgzj8y8o",
  "Bethlehem Christmas tree lights up for first time since start of Gaza war": "https://www.bbc.com/news/articles/ce86z84e947o",
  "India actor Dileep cleared in 2017 rape and abduction case of actress": "https://www.bbc.com/news/articles/czxgp9d29k5o",
  "Former Australian deputy PM joins anti-immigration party One Nation": "https://www.bbc.com/news/articles/cqxq8g4d873o",
  "Royal Navy unveils new Atlantic strategy to counter Russian threat": "https://www.bbc.com/news/articles/c3d01nxg0y0o"
}