{
  "South Korea protests Chinese and Russian warplanes in its airspace": "https://www.bbc.com/news/articles/cqxq38028djo",
  "US tells Thailand and Cambodia to stop fighting as clashes continue": "https://www.bbc.com/news/articles/cx2pn5dxd0go",
  "Man who grabbed Ariana Grande kicked out of Lady Gaga concert": "https://www.bbc.com/news/articles/cx2e0n3p9vvo",
  "Indian couple trolled over skin colour after wedding video goes viral": "https://www.bbc.com/news/articles/c62vnlg6v6wo",
  "'It's insulting they think we can't handle it': The Australian teens banned from social media": "https://www.bbc.com/news/articles/ckg9e1nl40wo",
  "Kids locked out of social media apps after Australia's world-first ban": "https://www.bbc.com/news/articles/cgl6gkd7pz6o",
  "Thousands flee Thai-Cambodia border after deadly clashes": "https://www.bbc.com/news/articles/cr7l0rjz05eo",
  "Woman who blackmailed Son Heung-min gets four years in jail": "https://www.bbc.com/news/articles/clydrywxwkro",
  "Trump gives Nvidia green light to sell advanced AI chips to China": "https://www.bbc.com/news/articles/ckg9q635q6po",
  "Japan protests after Chinese fighter jets lock radar on Japanese planes": "https://www.bbc.com/news/articles/c5yqe197ypno",
  "Man found guilty of Australian beach murder after hiding in India for years": "https://www.bbc.com/news/articles/c4g9lg7jvq7o",
  "Japan is facing a dementia crisis – can technology help?": "https://www.bbc.com/news/articles/c4g9e34yzvgo",
  "Little sleep, no pay: India's poll workers flag harsh conditions amid uproar over deaths": "https://www.bbc.com/news/articles/cy7v05exgdvo",
  "Can Japan get more female business leaders?": "https://www.bbc.com/news/articles/cn8e5ke4v70o",
  "Amazon, Microsoft pledge mega AI investments in India": "https://www.bbc.com/news/articles/c3w79pgn8peo",
  "String of celebrity scandals renews debate on South Korea's 'cancel culture'": "https://www.bbc.com/news/articles/c989e9xxn5po",
  "India orders IndiGo to slash flights as airline says operations 'normalised'": "https://www.bbc.com/news/articles/cx2dpl3994eo",
  "Jakarta office fire kills at least 22, police confirm": "https://www.bbc.com/news/articles/cwyp98vxk78o",
  "Does Japan's megaquake warning mean the 'big one' is coming?": "https://www.bbc.com/news/articles/cx2en927054o",
  "Why are Thailand and Cambodia fighting at the border?": "https://www.bbc.com/news/articles/cdjxje2pje1o"
}