{
    "Ukraine allies to hold talks on White House peace plan at G20": "https://www.bbc.com/news/articles/clyx9xnpll8o",
    "Trump ally Marjorie Taylor Greene to quit Congress after Epstein files feud": "https://www.bbc.com/news/articles/cj4qx1lenvjo",
    "Gunmen abduct more than 200 pupils from Nigerian Catholic school": "https://www.bbc.com/news/articles/cj4qxvy74qyo",
    "Family of missing Colombian seek answers after US strike on alleged drug boat": "https://www.bbc.com/news/articles/cgqlqjz30zxo",
    "Will Trump's no-show eclipse South Africa's G20 moment?": "https://www.bbc.com/news/articles/c20508y7w5yo",
    "Cold plunges and kombucha: Do winter wellness trends really work?": "https://www.bbc.com/news/articles/c5y4yk4nv5yo",
    "Five takeaways from Trump and Mamdani's surprisingly cordial meeting": "https://www.bbc.com/news/articles/cvgqd42gl0qo",
    "'A lot of fighting': Fossil fuel row breaks out at UN climate summit": "https://www.bbc.com/news/articles/c0q5ewew4geo",
    "Serbian president denies involvement in alleged Bosnia 'sniper tourism'": "https://www.bbc.com/news/articles/c246pv2n25zo",
    "Grizzly bear on loose after attacking school group in Canada, injuring 11": "https://www.bbc.com/news/articles/cz68x1n5qd6o",
    "How can you tell if your new favourite artist is a real person?": "https://www.bbc.com/news/articles/c5ylzjj5wzwo",
    "Palestinians forced from West Bank refugee camps left in limbo as Israeli demolitions go on": "https://www.bbc.com/news/articles/cg5m8qdl6n9o",
    "What we know about leaked US draft plan to end Russia's Ukraine war": "https://www.bbc.com/news/articles/cde6yld78d6o",
    "Steve Rosenberg: Putin uncompromising as leaked plan reaches Moscow": "https://www.bbc.com/news/articles/c5y9k0mrm2ro",
    "The Christian converts the US is deporting back to Iran": "https://www.bbc.com/news/articles/cdege0k962do",
    "How a flashy lawyer and an alleged Canadian drug lord may have taken down an FBI witness": "https://www.bbc.com/news/articles/c8747v1w7pyo",
    "Our babies were taken after 'biased' parenting test - now we're fighting to get them back": "https://www.bbc.com/news/articles/c1wlw2qj113o",
    "Tracking build-up of US military planes and warships near Venezuela": "https://www.bbc.com/news/articles/c7810w37vwdo",
    "India's blind women cricketers chase history at first T20 World Cup": "https://www.bbc.com/news/articles/c78z8n3kvnro",
    "Radiohead deliver a spell-binding, hit-packed set in London": "https://www.bbc.com/news/articles/clyz32pz81vo"
}