{
  "Sperm from donor with cancer-causing gene was used to conceive almost 200 children": "https://www.bbc.com/news/articles/ckgmy90z991o",
  "Ukraine 'ready for elections' if partners guarantee security, Zelensky says": "https://www.bbc.com/news/articles/cn5l1474yv7o",
  "South Korea protests Chinese and Russian warplanes in its airspace": "https://www.bbc.com/news/articles/cqxq38028djo",
  "Chaos in Brazil Congress during push to cut Bolsonaro's sentence": "https://www.bbc.com/news/articles/cvg8m5lj2lzo",
  "Trump criticises 'decaying' European countries and 'weak' leaders": "https://www.bbc.com/news/articles/clydlwldkvko",
  "'It's insulting they think we can't handle it': The Australian teens banned from social media": "https://www.bbc.com/news/articles/ckg9e1nl40wo",
  "US tells Thailand and Cambodia to stop fighting as clashes continue": "https://www.bbc.com/news/articles/cx2pn5dxd0go",
  "Nobel officials unsure when Peace Prize winner will arrive for ceremony": "https://www.bbc.com/news/articles/c208vd511ljo",
  "Man who grabbed Ariana Grande kicked out of Lady Gaga concert": "https://www.bbc.com/news/articles/cx2e0n3p9vvo",
  "Iain Douglas-Hamilton, pioneering elephant conservationist, dies aged 83": "https://www.bbc.com/news/articles/cwyx8yj410po",
  "Trump touts upbeat message on economy as Americans feel the pinch": "https://www.bbc.com/news/articles/ckgl63lrpkmo",
  "Congress ups pressure to release boat strike video with threat to Hegseth's travel budget": "https://www.bbc.com/news/articles/c773de38p2go",
  "How long Britain could really fight for if war broke out tomorrow": "https://www.bbc.com/news/articles/c5yq5zdv907o",
  "Indian couple trolled over skin colour after wedding video goes viral": "https://www.bbc.com/news/articles/c62vnlg6v6wo",
  "Two teenagers went to seek gold. They were buried alive in a mine collapse": "https://www.bbc.com/news/articles/cyvgq5nr05yo",
  "Ukrainians raise flag to show BBC the fight goes on in city claimed by Russia": "https://www.bbc.com/news/articles/cd6x3vv7y60o",
  "Why are Thailand and Cambodia fighting at the border?": "https://www.bbc.com/news/articles/cdjxje2pje1o",
  "Australia has banned social media for kids under 16. How will it work?": "https://www.bbc.com/news/articles/cwyp9d3ddqyo",
  "Amazon, Microsoft pledge mega AI investments in India": "https://www.bbc.com/news/articles/c3w79pgn8peo",
  "String of celebrity scandals renews debate on South Korea's 'cancel culture'": "https://www.bbc.com/news/articles/c989e9xxn5po"
}