{
  "Trump says he doesn't want Somalis in US as ICE plans Minnesota operation": "https://www.bbc.com/news/articles/c208x9v68w3o",
  "Search for long-missing Malaysia Airlines flight MH370 to resume": "https://www.bbc.com/news/articles/cy7v077dm0po",
  "Man charged with theft over claims he swallowed $19k Fabergé egg": "https://www.bbc.com/news/articles/c7vm754r80vo",
  "Crisis looms in Israel over ultra-Orthodox conscription bill": "https://www.bbc.com/news/articles/cly580gkd9ro",
  "As lead changes in knife-edge Honduran election, will Trump fail to get his way?": "https://www.bbc.com/news/articles/c9895x3039ro",
  "US defence secretary says he did not see survivors before follow-up strike on drug boat": "https://www.bbc.com/news/articles/ckglx77mplgo",
  "Ukrainians in war-ravaged Donbas weigh prospects of peace deal": "https://www.bbc.com/news/articles/cpq47derx2vo",
  "Italian fashion giant Prada buys Versace – at a discount": "https://www.bbc.com/news/articles/c3e05j9012vo",
  "YouTube says it will be less safe for kids under Australia's social media ban": "https://www.bbc.com/news/articles/cp341gz24p5o",
  "Delhi records 200,000 acute respiratory illness cases amid toxic air": "https://www.bbc.com/news/articles/cp39q5n5037o",
  "India tells smartphone makers to put state-run cyber safety app on new devices": "https://www.bbc.com/news/articles/cedxyvx74p4o",
  "Cyclone catastrophe in Sri Lanka awakens volunteer spirit": "https://www.bbc.com/news/articles/c058n10727po",
  "Was it a coup or was it a 'sham'? Behind Guinea-Bissau's military takeover": "https://www.bbc.com/news/articles/c1m8nm22785o",
  "'Hung by my wrists and beaten': Israeli-Russian woman says Iraqi militants tortured her in captivity": "https://www.bbc.com/news/articles/cj69588eewyo",
  "What was Honduras ex-president convicted of and why has Trump pardoned him?": "https://www.bbc.com/news/articles/c9qewln7912o",
  "Some Irish officers to get tasers in new six-month pilot scheme": "https://www.bbc.com/news/articles/c62njkreldzo",
  "Australia is banning social media for kids under 16. How will it work?": "https://www.bbc.com/news/articles/cwyp9d3ddqyo",
  "Republicans win Tennessee election despite Democratic fightback": "https://www.bbc.com/news/articles/cvgrpy9vzzno",
  "US cancels citizenship ceremonies for migrants from travel ban countries": "https://www.bbc.com/news/articles/cvg1q27l533o"
}